tap "acsandmann/tap"
tap "homebrew/services"
brew "python@3.13"
brew "ansible"
brew "cloudflared"
brew "cmake"
brew "epubcheck"
brew "fswatch"
brew "gdb"
brew "git-filter-repo"
brew "git-lfs"
brew "git-xet"
brew "gnu-prolog"
brew "goreleaser"
brew "jq"
brew "libpq"
brew "node"
brew "node@22"
brew "opam"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "portaudio"
brew "postgresql@14"
brew "postgresql@15"
brew "python-tk@3.13"
brew "python@3.10"
brew "ripgrep"
brew "ripgrep-all"
brew "tmux"
brew "vhs"
brew "watchman"
brew "wget"
cask "emacs-app"
cask "expo-orbit"
cask "mitmproxy"
vscode "bradlc.vscode-tailwindcss"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.colab"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
go "arcbranch"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "arcade"
cargo "cargo-generate"
cargo "evcxr_repl"
cargo "fosum"
cargo "newts"
cargo "oxdraw"
cargo "oxmap"
cargo "sqlx-cli"
cargo "taskim"
cargo "wasm-bindgen-cli"
