brew "fswatch"
brew "gdb"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "git-xet"
brew "go"
brew "helm"
brew "jq"
brew "libpq"
brew "neovim"
brew "node"
brew "pandoc"
brew "poppler"
brew "postgresql@15"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "tmux"
brew "uv"
brew "vhs"
brew "watchman"
brew "wget"
cask "codex"
cask "mitmproxy"
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
go "golang.org/x/tools/gopls"
cargo "arcade"
cargo "cargo-generate"
cargo "evcxr_repl"
cargo "fosum"
cargo "newts"
cargo "oxdraw"
cargo "oxmap"
cargo "sqlx-cli"
cargo "taskim"
cargo "tmuxtui"
cargo "wasm-bindgen-cli"
npm "@mermaid-js/mermaid-cli"
